import pytest

from src.services import get_search_numbers, get_search_str

transactions = [
    {"Дата платежа": "05.05.2025", "Описание": "Покупка в супермаркете", "Сумма операции": -350.00},
    {"Дата платежа": "06.05.2025", "Описание": "Оплата связи +7 915 668-93-25", "Сумма операции": -200.00},
    {"Дата платежа": "08.05.2025", "Описание": "Перевод на карту друга +7 1234 71-42-98", "Сумма операции": -500.00},
    {"Дата платежа": "09.05.2025", "Описание": "Оплата подписки Netflix", "Сумма операции": -600.00},
    {"Дата платежа": "11.05.2025", "Описание": "Обед в ресторане", "Сумма операции": -450.00},
    {"Дата платежа": "13.05.2025", "Описание": "Покупка билетов на концерт", "Сумма операции": -800.00},
    {"Дата платежа": "15.05.2025", "Описание": "Пополнение мобильного счета", "Сумма операции": -300.00},
    {"Дата платежа": "16.05.2025", "Описание": "Платеж за интернет +7 123 902-16-12", "Сумма операции": -350.00}
]

operations = [
    {"Дата платежа": "06.05.2025", "Описание": "Оплата связи +7 915 668-93-25", "Сумма операции": -200.00},
    {"Дата платежа": "08.05.2025", "Описание": "Перевод на карту друга +7 1234 71-42-98", "Сумма операции": -500.00},
    {"Дата платежа": "16.05.2025", "Описание": "Платеж за интернет +7 123 902-16-12", "Сумма операции": -350.00}
]

tran = [
    {"Дата платежа": "05.05.2025", "Описание": "Покупка в супермаркете", "Сумма операции": -350.00},
    {"Дата платежа": "09.05.2025", "Описание": "Оплата подписки Netflix", "Сумма операции": -600.00},
    {"Дата платежа": "11.05.2025", "Описание": "Обед в ресторане", "Сумма операции": -450.00},
    {"Дата платежа": "13.05.2025", "Описание": "Покупка билетов на концерт", "Сумма операции": -800.00},
    {"Дата платежа": "15.05.2025", "Описание": "Пополнение мобильного счета", "Сумма операции": -300.00}
]

oper = []


@pytest.mark.parametrize(
    "accepted, expected",
    [
        # Тест 1: Номера телефонов есть
        (
            transactions,
            operations
        ),
        # Тест 2: Номера телефонов отсутствуют
        (
            tran,
            oper
        )
    ]
)
def test_get_search_numbers(accepted, expected):
    result = get_search_numbers(accepted)
    assert result == expected


transact = [
    {"Дата платежа": "05.05.2025", "Описание": "Покупка в супермаркете", "Сумма": -350.00, "Категория": "Продукты"},
    {"Дата платежа": "06.05.2025", "Описание": "Оплата связи", "Сумма": -200.00, "Категория": "Связь"},
    {"Дата платежа": "07.05.2025", "Описание": "Покупка в аптеке", "Сумма": -150.00, "Категория": "Здоровье"},
    {"Дата платежа": "08.05.2025", "Описание": "Перевод на карту друга", "Сумма": -500.00, "Категория": "Переводы"},
    {"Дата платежа": "09.05.2025", "Описание": "Подписка Netflix", "Сумма": -600.00, "Категория": "Развлечения"},
    {"Дата платежа": "10.05.2025", "Описание": "Пожертвование в фонд", "Сумма": -100.00,
     "Категория": "Благотворительность"},
    {"Дата платежа": "11.05.2025", "Описание": "Продукты с ресторана", "Сумма": -450.00, "Категория": "Рестораны"},
    {"Дата платежа": "12.05.2025", "Описание": "Оплата коммунальных услуг", "Сумма": -1200.00,
     "Категория": "Коммунальные услуги"},
    {"Дата платежа": "13.05.2025", "Описание": "Покупка билетов на концерт", "Сумма": -800.00,
     "Категория": "Развлечения"},
    {"Дата платежа": "14.05.2025", "Описание": "Продукты в магазине", "Сумма": -250.00, "Категория": "Продукты"},
    {"Дата платежа": "15.05.2025", "Описание": "Пополнение мобильного счета", "Сумма": -300.00, "Категория": "Связь"},
    {"Дата платежа": "16.05.2025", "Описание": "Платеж за интернет", "Сумма": -350.00, "Категория": "Интернет"},
    {"Дата платежа": "17.05.2025", "Описание": "Бензин на заправке", "Сумма": -1200.00, "Категория": "Транспорт"}
]

operat = [
    {"Дата платежа": "05.05.2025", "Описание": "Покупка в супермаркете", "Сумма": -350.00, "Категория": "Продукты"},
    {"Дата платежа": "11.05.2025", "Описание": "Продукты с ресторана", "Сумма": -450.00, "Категория": "Рестораны"},
    {"Дата платежа": "14.05.2025", "Описание": "Продукты в магазине", "Сумма": -250.00, "Категория": "Продукты"}
]


@pytest.mark.parametrize(
    "accepted, string, expected",
    [
        # Тест 1:
        (
            transact,
            "Продукты",
            operat
        ),
        # Тест 2:
        (
            transact,
            "Топливо",
            []
        )
    ]
)
def test_get_search_str(accepted, string, expected):
    result = get_search_str(accepted, string)
    assert result == expected
