import pandas as pd
import pytest

from src.reports import spending_by_category


@pytest.mark.parametrize(
    "df, category, date, expected",
    [
        # Тест 1: все параметры переданы, все получено
        (
            pd.DataFrame({
                "Дата платежа": ["10.01.2024", "11.01.2024"],
                "Категория": ["Связь", "Связь"],
                "Сумма операции": [-250.0, -300.0]
            }),
            "Связь",
            "18.02.2024",
            pd.DataFrame({
                "Категория": ["Связь", "Связь"],
                "Сумма трат": [250.0, 300.0]
            })
        ),
        # Тест 2: не нашел соответствий по категории
        (
            pd.DataFrame({
                "Дата платежа": ["12.12.2020", "11.01.2024"],
                "Категория": ["Связь", "Цветы"],
                "Сумма операции": [-250.0, -300.0]
            }),
            "Топливо",
            "20.10.2021",
            pd.DataFrame({
                "Категория": ["Топливо"],
                "Сумма трат": ["Не найдено"]
            })
        ),
        # Тест 3: дата слишком старая
        (
            pd.DataFrame({
                "Дата платежа": ["10.01.2024", "11.02.2024", "16.10.2023"],
                "Категория": ["Связь", "Цветы", "Топливо"],
                "Сумма операции": [-250.0, -300.0, -600.0]
            }),
            "Топливо",
            "20.10.1967",
            pd.DataFrame({
                "Категория": ["Топливо"],
                "Сумма трат": ["Не найдено"]
            })
        ),
    ]
)
def test_spending_by_category(df, category, date, expected):
    result = spending_by_category(df, category, date)
    pd.testing.assert_frame_equal(result, expected)
